 clear all;
x=[0.056	0.084	0.031	0.038	0.0081	0.022;...
   0.049	0.055	0.100	0.110	0.022	0.0073;...
   0.038	0.130	0.079	0.170	0.058	0.043;...
   0.034	0.095	0.058	0.160	0.200	0.029;...
   0.084	0.066	0.029	0.320	0.012	0.041;...
   0.064	0.072	0.100	0.210	0.028	1.380;...
   0.048	0.089	0.062	0.260	0.038	0.036;...
   0.069	0.087	0.027	0.050	0.089	0.021];
a1=mean(x);
stdr=std(x);
sr=(x-a1(ones(8,1),:))./stdr(ones(8,1),:);  %输入矩阵标准化处理
r=corrcoef(sr);        %相关矩阵
[v,d]=eig(r);        %求特征值和特征向量
d=d(6:-1:1,6:-1:1);       %特征值从大到小排序
v=v(:,6:-1:1);       %特征向量也相应排序
aa=sum(d);
a2=100*d/sum(aa);        %求因子对方差的贡献率,由此确定主因子数
for i=1:6         %求因子最初阵
    for j=1:6,
        a3(j,i)=v(j,i)*sqrt(aa(i));
    end
end
a3=a3(:,1:2);       %求主因子最初阵，此例为2
v=v(:,1:2);       %对应的特征向量
for i=1:6        %求主因子方差
    a(i)=0;
    for j=1:2
        a(i)=a(i)+a3(i,j)^2;
    end
end
for i=1:2         %求公因子贡献
    a5(i)=0;
    for j=1:6
        a5(i)=a5(i)+a3(j,i)^2;
    end
end
for i=1:6        %对主因子矩阵正规化处理
    for j=1:2
        a3(i,j)=a3(i,j)/sqrt(a(i));
    end
end
v2=1e+10;
for kk=1:20          %矩阵旋转的最大次数
    c1=0;b=0;        %求主因子矩阵的方差
    for j=1:2
        c=0;
        for i=1:6
            b=b+a3(i,j)^4;
            c=c+a3(i,j)^2;
        end
        c1=c1+c*c;
    end
    v1=b/6-c1/6^2;
    if abs(v1-v2)<=1e-5       %判断是否需要旋转
        break
    end
    a3=ration(a3);    %矩阵旋转
    v2=v1;
end
a3;         %最大方差矩阵
y1=a3'*inv(r);       %求因子得分系数阵
for j=1:8
    for i=1:2
        f(i)=0;
        for k=1:6
            f(i)=f(i)+y1(i,k)*x(j,k);  %因子得分函数系数
        end
        y2(j)=f(1);      %主因子的得分
    end
    y3(j)=f(i);
end
y2;         %第一主因子得分
y3;         %第二主因子得分
plot(y2,y3,'mp');
gname
