clear all;
 x=[0.056	0.084	0.031	0.038	0.0081	0.022;...
   0.049	0.055	0.100	0.110	0.022	0.0073;...
   0.038	0.130	0.079	0.170	0.058	0.043;...
   0.034	0.095	0.058	0.160	0.200	0.029;...
   0.084	0.066	0.029	0.320	0.012	0.041;...
   0.064	0.072	0.100	0.210	0.028	1.380;...
   0.048	0.089	0.062	0.260	0.038	0.036;...
   0.069	0.087	0.027	0.050	0.089	0.021];
[r,t]=size(x);
xx=0;
for i=1:r         %对原始矩阵进行变换
    x1(i)=0;
    for j=1:t,
        x1(i)=x1(i)+x(i,j);
    end
    xx=xx+x1(i);
end
for j=1:t
    x2(j)=0;
    for i=1:r,
        x2(j)=x2(j)+x(i,j);
    end
end
for i=1:t,          %求新矩阵
    for j=1:r        
        z(j,i)=(x(j,i)-x1(j)*x2(i)/xx)/sqrt(x1(j)*x2(i));
    end
end
r1=z'*z;        %协方差阵
[v1,d1]=eig(r1);  %求特征值和特征向量
d1=d1(6:-1:1,6:-1:1); 
v1=v1(:,6:-1:1);
aa1=sum(d1);
a21=100*d1/sum(aa1);    %求方差贡献率
for i=1:6
    for j=1:6
        a3(j,i)=v1(j,i)*sqrt(aa1(i));
    end
end
a3=a3(:,1:2);      %R-型因子栽荷阵
v1=v1(:,1:2);
d1=d1(:,1:2);
v3=z*v1;      %Q型因子特征向量
for j=1:2      %Q型因子的载荷阵
    b=0;
    for i=1:r,
        b=b+v3(i,j)^2;
    end
    for i=1:r      %Q型因子特征向量正规化处理
        v3(i,j)=v3(i,j)*sqrt(aa1(j))/sqrt(b);
    end
end
v3       %Q-型因子的载荷阵
plot(a3(:,1),a3(:,2),'+',v3(:,1),v3(:,2),'rp');  %"+"变量点,'星号'样品点
gname
