clear all;
x=[1 1 1 1 1 1 1 228.6;1 1 1 2 2 2 2 225.8;1 2 2 1 1 2 2 230.2;1 2 2 2 2 1 1 218.0;...
   2 1 2 1 2 1 2 220.8;2 1 2 2 1 2 1 215.8;2 2 1 1 2 2 1 228.5;2 2 1 2 1 1 2 214.8];
f=2;r=7;
[r1,c]=size(x);
t=zeros(f,r);
for k=1:f
    for j=1:r
        b=0;
        for i=1:r1
            if x(i,j)==k   %水平相同
                b=b+x(i,c);
            end
        end
        t(k,j)=b;
    end
end
T=t/4,R=max(t/4)-min(t/4)


 g1={[1 1 1 1 2 2 2 2];[1 1 2 2 2 2 1 1];[1 2 1 2 1 2 1 2];[1 2 1 2 2 1 2 1];...
[1 2 2 1 1 2 2 1]};
 anovan(x(:,c),g1)'  %将A×B和A×C作为AB、AC看待
