 clear all;
PHO=[1	0.79	0.36	0.76	0.25	0.51;0.79	1	0.31	0.55	0.17	0.35;...
    0.36	0.31	1	0.35	0.64	0.58;0.76	0.55	0.35	1	0.16	0.38;...
    0.25	0.17	0.64	0.16	1	0.63;0.51	0.35	0.58	0.38	0.63	1];
%利用pcacov函数根据相关系数矩阵作主成分分析，返回主成分表达式的系数
%矩阵COEFF，返回相关系数矩阵的特征值向量latent和主成分贡献率向量explained
[COEFF,latent,explained] = pcacov(PHO)

%为了更加直观，以元胞数组形式显示结果：
>> S(1,:)={'特征值','差值','贡献率','累积贡献率'};
S(2:7,1)=num2cell(latent);
S(2:6,2)=num2cell(-diff(latent));
S(2:7,3:4)=num2cell([explained,cumsum(explained)])

%以元胞数组形式显示前3个主成分表达式
H={'标准化变量';'x1：身高';'x2：坐高';'x3：胸围';'x4：手臂长';'x5：肋围';'x6：腰围'};
S1(:,1)=H;
S1(1,2:4)={'Prin1','Prin2','Prin3'};
S1(2:7,2:4)=num2cell(COEFF(:,1:3))
