 clear all;
Y=[1 1	1	1	1 1	569;2 1	1	2	2	2	554;3 1	1	3	3	3	637;...
   4 1	2	1	2 3	566;5 1	2	2	3	1	565;6 1	2	3	1	2	648;...
   7 1	2	1	3 2	581;8 1	3	2	1	3	568;9 1	3	3	2	1	535;...
   10 2	1	1	1 1	593;11 2	1	2	2 2	615;12 2	1	3	3	3	620;...
   13 2	2	1	2 3	586;14 2	2	2	3	1	597;15 2	2	3	1	2	617;...
   16 2	3	1	3 2	599;17 2	3	2	1	3	613;18 2	3	3	2	1	580;...
   19 3	1	1	1 1	569;20 3	1	2	2	2	615;21 3	1	3	3	3	591;...
   22 3	2	1	2 3	586;23 3	2	2	3	1	616;24 3	2	3	1	2	630;...
   25 3	3	1	3 2	566;26 3	3	2	1	3	638;27 3	3	3	2	1	573];
y=Y(:,7);               %提取Y的第7列数据，即产蛋量y
A=Y(:,2);               %提取Y的第2列数据，即因素A的水平列表
B=Y(:,3);               %提取Y的第3列数据，即因素B的水平列表
C=Y(:,4);               %提取Y的第4列数据，即因素C的水平列表
D=Y(:,6);               %提取Y的第6列数据，即因素D的水平表
E=Y(:,5);               %提取Y的第5列数据，即因素E的水平表
varnames={'A','B','C','D','E'};      %定义因素名称
%定义模型的效应项矩阵，考虑主效应:A,B,C,D,E，交互效应：AB,AC,AE
model=[eye(5);1 1 0 0 0;1 0 1 0 0;1 0 0 0 1]
%调用anovan函数作因素一元方差分析
[p,table]=anovan(y,{A,B,C,D,E},'model',model,'varnames',varnames)



%调用multcompare对5个因素的各水平进行多重比较
[c,m,h,gnames]=multcompare(stats,'dimension',[1,2,3,4,5]);
%将各处理的均值从小到大进行排序
[mean,id]=sort(m(:,1));
%将各处理的名称按均值从小到大进行排序
gnames=gnames(id);
%显示排序后的20个处理的名称及相应的均值
[{'处理','均值'};gnames(end-19:end),num2cell(mean(end-19:end))]
